/// int get lenght
/// 
/// Вызвать метод для списка == null, с одним элементом, и с двумя (больше одного).
/// Посмотреть что метод возвращает и как меняется список.
/// Создаём список == null, список с одним элементом == 5, список с элементами 5, 77 и список с элементами 1, 2, 15, 4, 16.
/// У каждого списка вызываем метод.
/// Смотрим чего вернул метод. Должен вернуть: 0, 1, 2 и 5 соответсвенно для каждого списка.
/// Смотрим изменился ли список. Список измениться не должен.
/// На всякий случай вызываем для каждого списка этот метод два раза подряд. 
/// Опять проверяем то, что вернул метод. Должен вернуть оба раза тоже, что и в самый первый раз.
/// Смотрим изменился ли список. Список измениться не должен.
/// Думаю, двух раз подряд итак достаточно. Если где-то что-то переполняется или ещё какой глюк, я его сейчас всё равно не предвижу.
